{"title":"In Which I Rediscover Gaming","topic":"Notes and Musings","summary":"The story of how I began gaming again after 20 years, and an introduction to the Thornbare characters and campaign.","content":"<p>\r\n\tAfter a hiatus of nearly 20 years, I have returned to gaming. I started playing the <em>original</em> Dungeons &amp; Dragons game with my parents when I was seven years old; as I grew into my teens, I moved to AD&amp;D and had a regular gaming group of neighborhood friends. We experimented with other RPGs but always came back to AD&amp;D. As the de facto dungeon master, I channeled hours and hours of creative energy into the creation of the game world, drawing inspiration from the boxed set of the Greyhawk campaign setting.</p>\r\n<p>\r\n\tI played a bit in college, and for about a year afterward, but soon after getting married and becoming a father I put gaming aside altogether and devoted myself to my family, <a href=\"http://www.idolhands.com/\">my professional development</a> and <a href=\"http://www.dustandashadow.com\">my other pursuits</a>.</p>\r\n<h2>\r\n\tThe Red Box</h2>\r\n<p>\r\n\t<img alt=\"\" src=\"http://brambles.s3.amazonaws.com/ckeditor/picture/data/4db2e7ed443b5627e400000f/content_red_box.png\" style=\"margin-left: 20px; margin-right: 20px; margin-top: 20px; margin-bottom: 20px; float: right; width: 200px; height: 267px; \" /></p>\r\n<p>\r\n\tAll that changed a couple of months ago, when my wife, an avid resale shopper, came home with the red box set of Dungeons &amp; Dragons. A wave of nostalgia washed over me. &quot;It&#39;s a crime,&quot; she said, &quot;that we&#39;re raising a geek daughter but she&#39;s never played D&amp;D.&quot; It was true-- Lydia, my teenaged daughter, was missing out on geek cred by not having been exposed to RPGs. And, as it turned out, even my sister Miranda had only played MMORPGs, nothing at the tabletop! This obviously was a sad state of affairs, so I set out to change it all.</p>\r\n<p>\r\n\tWe started running through the sample adventure that came in the DM&#39;s guide, but my creative impulses got the better of me. After the first night of play I bought the latest DnD 4e rulebooks, sat down with graph paper, and started mapping out a proper dungeon and thinking about an overall campaign. I had work to do.</p>\r\n<h2>\r\n\tThe Cast of Characters</h2>\r\n<p>\r\n\tI especially wanted to draw Lydia into the game, so I started by creating a brief sketch of her character&#39;s history. She had rolled a magic user named Larina, of approximately her own age. I decided that Larina was not yet a hero, but on a path of self-discovery that would lead her to her destiny. Lydia and I talked about her backstory and agreed that Larina was the only daughter of a miller and his wife. She had been taught a simple light cantrip by Mama Ness, a mysterious but friendly old woman who lived down the road, and this was her first introduction to magic-- a passion that she would end up devoting her life to.</p>\r\n<p>\r\n\tMy sister created Daegerwin, a Tiefling thief and street urchin who specialized in sneaking treasure into her own pockets at the expense of the party-- all the while with a charming smile.</p>\r\n<p>\r\n\tLisa decided to play a simple fighter, the son of Mama Ness who was only referred to by his mother-- and everyone else-- as Boy.</p>\r\n<p>\r\n\tAt the start of the game, Larina&#39;s household was in a state of chaos. Her mother&#39;s ring had been sent to the nearby town of Thornbare to be repaired by the local tinker, but the tinker had been robbed and the ring was gone. Larina decided to head into town to see if she could help track down its whereabouts.</p>\r\n<p>\r\n\tAlong the way, she stopped in to see Mama Ness, who insisted that Boy accompany Larina on her first trip to the city, for her protection. Boy shrugged and assented, happy to be relieved of his chores around the house.</p>\r\n<p>\r\n\tBoy and Larina arrived in Thornbare without incident, but as they approached the tinker&#39;s shop they were nearly bowled over by Daegerwin, who was in the process of being thrown out of the shop with cries of &quot;Dirty thief!&quot; Daegerwin, sensing opportunity in the two country folk, immediately befriended them and agreed to wait outside while they interviewed the tinker.</p>\r\n<p>\r\n\tIt turned out that the tinker was accosted by goblins at the crossroads, and that Larina&#39;s mother&#39;s ring was among the loot that the goblins stole. The party decided to investigate, and the adventure began...</p>\r\n<h2>\r\n\tA Gamer is Born</h2>\r\n<p>\r\n\tLydia and Miranda took to the game right away, and Lisa and I were happy to be playing again after so many years. Now we gather as a family every week to continue the adventure, and I have (yet another) creative outlet as I expand the story and the world beyond the simple countryside and into the dangerous environs surrounding Thornbare.</p>\r\n<p>\r\n\tThis site will chronicle two adventures: that of the party itself, and my own adventure in returning to the game after so many years. Along the way I&#39;ll share what I learn, what I create, and what I think in the hopes that it will be of interest and use to other gamers.</p>\r\n"}
{"title":"An Agile Approach to Campaign Design","topic":"Notes and Musings","summary":"As a DM, it's easy to fall into the trap of Big Upfront Design and end up taking on more  work than is required for a given stage in a campaign. This article discusses an alternative inspired by the latest trends in the software development field.","content":"<h3>A Brief History of Software Development (Bear With Me)</h3>\r\n\r\n<p>In the old days of software development, the predominant methodology was something called the Waterfall model. In short, waterfall entails a sequential design process, with progress flowing through phases of conception, analysis, design, construction, and implementation. Success required extensive planning in the early stages of a project, and any changes to specifications tended to have a ripple effect that would disrupt the entire process-- encouraging a cover-your-ass approach referred to colloquially as Big Upfront Design.</p>\r\n\r\n<p>The modern alternative to the waterfall methodology is something called Agile development. In Agile, you create a working list of what the system needs to accomplish-- called a backlog-- and organize items from the backlog into sprints, which are two- to four-week periods of intensive development. At the end of each sprint, you have a system with working components that meet the baseline requirements for the current phase of work. If new ideas emerge during the sprint, they are added to the backlog for future implementation. This approach embraces change and uncertainty and focuses on delivering the most important features first.</p>\r\n\r\n<h3>Applying Agile Techniques to Campaign Design</h3>\r\n\r\n<p>Fine, you say, but what does this have to do with Dungeons and Dragons? Actually, quite a bit. Whatever you're creating-- be it a campaign setting, an adventure, or an entire world-- it's easy to fall into the trap of Big Upfront Design and end up taking on more than is required for a given stage in a campaign. For example, do you really need extensive tables describing the weather when the characters are going to be spending their first few adventures underground? Does the succession of kings in the province of Madeupia come into play in the current phase of the campaign story arc? Do you need a complete pantheon of gods and goddesses with their own mythology and backstory?</p>\r\n\r\n<p>At the start of a campaign, it can be tempting to try to completely flesh out the setting before the first game even starts. You may be inspired by literary works, or prepackaged campaign settings, or your own urge to create, and feel an overwhelming pressure to design the setting down to the last detail before your characters take their first steps in their new world. This creates an awful lot of pressure on you, the DM, and doesn't really move the campaign forward very much when you consider the amount of effort you put into it.</p>\r\n\r\n<p>I recommend instead that you follow a methodology like the Agile approach to software development. Make a list of what you need immediately, in the near term, and in the long term. Prioritize these needs based on when they will come into play, then divide your design time into small, workable chunks. Focus on delivering just what is needed, just in time, and keep a running list of new ideas that occur to you as you go. At the end of every design or writing sprint, take pride in checking items off the backlog and spend a few minutes reprioritizing the remaining items from your list.</p>\r\n\r\n<p>The Agile approach to campaign design lets the campaign setting evolve naturally according to the flow of the story and the actions of the adventurers. Anticipate their needs and let them explore the ever-expanding world around them, without overwhelming them with details that really don't contribute to the current chapter in their stories. Keep sketches of where you expect things to go, determine what and when you will need in the near- and mid-term, and just design as you go. You'll find that your creation will take on a life of its own, informed by the stories you craft and the interactions between your players, your NPCs, and the environment itself.</p>\r\n"}
{"title":"Throwing Knives","topic":"Challenges & Encounters","summary":"This encounter challenges the party to a game of throwing knives, with their lives at stake.","content":"<p>\r\n\tThe party opens a door to discover a room in complete shambles. It was obviously a game room in its day; a collapsed billiard table takes up most of the room, along with several smallish tables strewn with the remains of decks of cards. A dartboard is on the far wall, with several throwing knives sticking out of it.</p>\r\n<p>\r\n\tWhen the players enter, a masked figure steps into view, draped in an elaborate cloak. In a husky voice, it invites the players to take part in a &quot;game of skill and chance&quot;. If the players win, they will gain something that the figure promises is of great value. If the players lose, they will have to fight to the death. If the players agree to the challenge, then the throwing-knife game is on.</p>\r\n<p>\r\n\tThe party must pick a player to represent them. Each participant gets three throws, and makes a Dexterity check vs the appropriate quadrant of the dart board:</p>\r\n<table style=\"width: 200px; float: right; margin: 1em;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th>\r\n\t\t\t\tDC</th>\r\n\t\t\t<th>\r\n\t\t\t\tPoints</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr class=\"odd\">\r\n\t\t\t<td>\r\n\t\t\t\t10</td>\r\n\t\t\t<td>\r\n\t\t\t\t5 points</td>\r\n\t\t</tr>\r\n\t\t<tr class=\"even\">\r\n\t\t\t<td>\r\n\t\t\t\t15</td>\r\n\t\t\t<td>\r\n\t\t\t\t10 points</td>\r\n\t\t</tr>\r\n\t\t<tr class=\"odd\">\r\n\t\t\t<td>\r\n\t\t\t\t20</td>\r\n\t\t\t<td>\r\n\t\t\t\t20 points</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n<p>\r\n\tFailing a roll rewards the next lowest class of points.</p>\r\n<p>\r\n\tThe masked figure has a slight advantage in the game: all three of his throwing knives are +1 daggers. His Dexterity bonus is +2, so he rolls d20+3.</p>\r\n<p>\r\n\tTrue to his word, if the players win, he will give them a key to a locked chest containing an item of the DM&#39;s choice, and the party will be rewarded with 100 XP.</p>\r\n<p>\r\n\tIf the masked figure wins, then he will turn his attacks on the party, focusing on the loser in the game.</p>\r\n"}
{"title":"Approaching Castle Bramble","topic":"Environs","summary":"Nestled in the center of the sprawling forest of the Brambles, Castle Bramble looms like a beast poised to strike. The large double doors leading into the castle hang open, one door fallen from its hinges. All is dark and silent beyond the doors.","content":"<p>\r\n\tThe trip through The Brambles ends when the party sees the castle rise up out of the trees. Although somewhat worse for wear, the castle is far from ruined, despite being abandoned for almost a hundred years. The large double doors leading into the castle hang open, one door fallen from its hinges. All is dark in the room behind the doors.</p>\r\n<p>\r\n\tThe building stands three stories tall, with some sort of glass hemispherical structure on the roof. Three towers rise from the corners, one somewhat taller than the others, and lights shine from a few of the windows. Trees press in from all sides.</p>\r\n<p>\r\n\t<img alt=\"Castle Bramble\" src=\"http://brambles.s3.amazonaws.com/ckeditor/picture/data/4db25e18e746cd51ad000005/content_castle_bramble.png\" style=\"width: 600px; height: 456px; border: 1px solid #444444;\" /></p>\r\n<p>\r\n\tNestled in the center of the sprawling forest known simply as The Brambles, Castle Bramble consists of three occupied levels, a rooftop garden, and a cellar. Three towers rise above the castle, one of which provides a spiral staircase connecting the upper floors, another offering various rooms for residents of the castle, and the third and tallest tower claimed by Barnabus the Mad as his private residence.</p>\r\n<p>\r\n\tLargely given over to the elements since the front doors gave in to the ravages of time, the first floor of the castle reveals the owner&rsquo;s taste for decadence and luxury. The walls are painted with murals depicting a hunting lifestyle, hand-carved decorative panelling lines the walls of the corridors, and a grand (but decayed and debris-strewn) entryway greets visitors.</p>\r\n<p>\r\n\tFeaturing guest rooms and a game room, the level presents the first opportunity for meeting the unfortunate prisoners of the castle-- the undead celebrants in their hundreth year of the Loomies Ball.</p>\r\n<p>\r\n\tThe ballroom dominates the third level of the Castle, where most of the guests are caught up in an unending dance.</p>\r\n<p>\r\n\tThe rooftop is home to an overgrown and sinister greenhouse, as well as the top level of Barnabus&rsquo; personal quarters in the northeast tower.</p>\r\n"}
{"title":"Setting Up an Encounter Map Template in OmniGraffle","topic":"Cartography","summary":"This article will guide you through the process of creating a basic template for encounter maps using OmniGraffle, with a little help from Photoshop.","content":"<p>\r\n\t<a href=\"http://www.omnigroup.com/products/omnigraffle/\" target=\"_blank\">OmniGraffle</a> is one of my favorite Mac OS X apps, so it comes as little surprise that I would turn to this charting standby for my cartography needs. I&#39;m in the process of creating templates and stencils for dungeon maps and encounter maps to share with the world, but in the mean time I thought that it might be useful to share the techniques that I&#39;m in the process of perfecting.</p>\r\n<p>\r\n\tThis article will guide you through the process of creating a basic template for encounter maps using OmniGraffle, with a little help from Photoshop.</p>\r\n<h2>\r\n\tStep One: Creating a Template File</h2>\r\n<p>\r\n\tCreating a template file in OmniGraffle is trivial. From the file menu, select <em>New Resource &gt; New Template</em>. Make sure that &quot;Blank&quot; is selected in the template chooser, then click &quot;New Template&quot;. Save the resulting file as &quot;Encounter Map&quot;.</p>\r\n<h2>\r\n\tStep Two: Creating Background Image</h2>\r\n<p>\r\n\tI like to use a parchment texture as a background for my encounter maps. In Photoshop, create a new document that&#39;s 10.5 inches by 8 inches large. Make sure that the resolution is set at 300dpi for best results in printing.</p>\r\n<p>\r\n\tNow you&#39;ll need to pick the colors for your parchment background. Set the foreground and background color chips to <code>#dac582</code> and <code>#77663a</code> respectively.</p>\r\n<p>\r\n\tNext, go to the Filters menu and select <em>Filter &gt; Render &gt; Clouds</em>. You should get a nice fill with a lot of texture. Save this file as a 24bit PNG, with the filename &quot;parchment_bg.png&quot;. The file size will be pretty big, so this step may take a few moments.</p>\r\n<p>\r\n\t<img alt=\"\" src=\"http://brambles.s3.amazonaws.com/ckeditor/picture/data/4db2f7a5f6812d3426000002/content_image_palette.png\" style=\"margin-left: 20px; margin-right: 20px; margin-top: 20px; margin-bottom: 20px; float: right; width: 270px; height: 274px; \" /></p>\r\n<p>\r\n\tNow, in Omnigraffle, make sure that nothing is selected. In the Style palette, click on the Image icon and click the tray. Now drag your parchment background file into the tray, and you should see the template fill with your custom background.</p>\r\n<br style=\"clear: both;\" /><br /><h2>\r\n\tStep Three: Setting Up the Grid</h2>\r\n\t<img alt=\"\" src=\"http://brambles.s3.amazonaws.com/ckeditor/picture/data/4db2f7e9f6812d3426000004/content_grid_palette.png\" style=\"margin-left: 20px; margin-right: 20px; margin-top: 20px; margin-bottom: 20px; float: right; width: 270px; height: 267px; \" />\r\n<p>\r\n\tNext we&#39;ll create the grid overlay for the encounter map. In the floating palette, click on <em>Canvas: Size</em>. Set the <em>Orientation</em> to <em>Landscape</em>, the <em>Ruler Units</em> to <em>Feet</em>, and the <em>Unit Scale</em> to <em>1in = 5&#39;</em>.</p>\r\n<p>\r\n\tNow click <em>Canvas: Grid</em> on the floating palette. Set the Major Grid Spacing to 5&#39;, and set the color to black and the opacity to 25%. For the Minor Grid Spacing, click the color well and set the opacity to 0% to completely hide the minor grid. Finally, select all the grid options (Snap to grid, grid in front, show grid lines, show major, print grid) and your settings should look like those on the right.</p>\r\n\r\n<h2>\r\n\tStep Four: There Is No Step Four.</h2>\r\n<p>\r\n\tThat&#39;s it, you&#39;re finished. Now, when you&#39;re ready to create an encounter map, just use <em>File &gt; Template Chooser</em>, select Miscellaneous, and click on your new template.</p>\r\n<p>\r\n\tIn a future article I&#39;ll share tips on using Omnigraffle for actually creating the encounter map itself, but this should be enough to get you started.</p>\r\n"}
{"title":"Apprentice RPG Beta Launch","topic":"Resources","summary":"Introducing Apprentice RPG, a Mac OS X-friendly DnD 4e web application for managing monsters and characters, designing challenges, and running encounters.","content":"<p>\r\n\tWhen my wife brought home an old Dungeons and Dragons box set from Goodwill, a wave of nostalgia washed over me. I grew up playing RPGs, but stopped sometime in my early 20s. The idea of returning to gaming appealed to me on several levels:</p>\r\n<ul>\r\n\t<li>\r\n\t\tIt would be nice to do something as a family that didn&#39;t involve working on the house or watching a screen.</li>\r\n\t<li>\r\n\t\tNow that my daughter is a teenager, I feel a responsibility to develop in her as much geek cred as possible.</li>\r\n\t<li>\r\n\t\tI could use yet another hobby with all of this free time on my hands. (Um.)</li>\r\n\t<li>\r\n\t\tGaming is just a lot of fun.</li>\r\n</ul>\r\n<div class=\"featured_image\" style=\"float: right; margin: 1em;\">\r\n\t<img alt=\"Keep the dice. Lose the paper.\" src=\"http://idolhands.s3.amazonaws.com/ckeditor/picture/data/4da99e20e78aaf12c4000001/content_apprenticerpg.jpg\" style=\"width: 282px; height: 300px; \" /></div>\r\n<p>\r\n\tThe old rulebooks were fun, but I wanted to see what had become of the game in the past 20 years, so I went out and bought the new 4th Edition rules. I fired up Pages and OmniGraffle and almost immediately started designing my first adventure. We&#39;ve been playing now for about 6 weeks, and having a blast.</p>\r\n<p>\r\n\tThe only thing that bothered me was the amount of tracking that I had to do on paper. Monster stats, hit points, action points, and so on littered half a dozen sheets of paper scattered behind my DM screen. As a geek, I knew that there had to be a better way. I checked online for resources, but only found Windows software. What the hell, isn&#39;t this 2011? So I fired up BBEdit, started a new project on GitHub, and... ApprenticeRPG.com was born.</p>\r\n<p>\r\n\tI developed Apprentice as a Rails 3 app that uses Mongoid as its database backend. It&#39;s hosted on the amazingly awesome Heroku servers, with cloud-based database functionality provided by MongoHQ. I&#39;m using PivotalTracker to manage features and Lighthouse to track bugs, both publicly accessible.</p>\r\n<p>\r\n\tIt&#39;s only been two short weeks, and already the public site is live and there&#39;s a beta program for people to use. This is a testament to the ease of development that Rails engenders, and the amazing resources that are available for launching and managing web applications in the age of the cloud.</p>\r\n<p>\r\n\tI&#39;m hoping to generate some good buzz, get a load of feature requests from real live players, and launch version 1.0 of the app by June of this year.</p>\r\n<p>\r\n\tCheck it out at <a href=\"http://www.apprenticerpg.com\" title=\"Apprentice RPG\">www.apprenticerpg.com</a>. And if you&#39;re a gamer geek, by all means sign up for the beta.</p>\r\n"}
{"title":"From WoW to DnD","topic":"Game Journal","summary":"In which Miranda recounts the challenges and rewards facing a first-time gamer transitioning from MMORPG to plain old RPG.","content":"<p>\r\n\t&nbsp;</p>\r\n<div>\r\n\tI have always prided myself on my geeky nature. &nbsp;My family is made up of geeks; one of my favorite pictures of my brother and me has him sitting at our old Commodore 64 while I sit in a chair beside him. &nbsp;I can&#39;t have been more than two or three at the time.</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tIt came as a big surprise to Corey, then, that I had never tried Dungeons and Dragons. &nbsp;It wasn&#39;t my choice. &nbsp;I had always wanted to give it a shot, but I never could find the community for it. &nbsp;My friends at the time in Virginia were heavily into PC/console gaming but not so much into anything that required roleplay. &nbsp;After moving to Chicago, it fell off my radar after I discovered the wonderful and, admittedly, highly addictive world of MMORPGs.</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tWhen Corey and Lisa suggested that we try a DnD campaign as a family, I felt a strong mix of trepidation and excitement. &nbsp;Finally, my chance to try tabletop gaming! &nbsp;New worlds would be ours! &nbsp;We would come together as a family under a big geeky banner! &nbsp;Live roleplay!</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tWait, what?</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tYes, that was what got me. &nbsp;I have been roleplaying on forums, over instant messaging, and in World of Warcraft for almost five years now. &nbsp;I love words, I love characters, I love creating histories, and I love losing myself in someone who is everything I am not. &nbsp;But the thought of doing this live, with people looking at me, was something altogether different.</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tI am socially awkward at the best of times. &nbsp;I have a tendency to slur my words together when I get flustered. &nbsp;Now I was being expected to not only learn how to play a game that was completely unlike the MMORPGs I had been playing, but to act it out in real time. &nbsp;This would be scary enough for someone like me, but to do it with my immensely creative and talented brother watching me was something beyond terrifying.</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tI created Daegerwin, a Tiefling thief with a big floppy hat and a silver tongue. &nbsp;She was heavily based on a night elf rogue I had roleplayed in WoW for about a year, making her a little more comfortable for me to start with. &nbsp;My biggest piece of advice for people who are afraid of live roleplaying is to make someone extravagant. &nbsp;It is easy to be over-the-top - at least it was for me - but being someone &quot;normal&quot; is considerably more difficult, as I would find out later.</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tOur first adventure was fun from a roleplaying perspective and a little frustrating from a gameplay perspective. &nbsp;DnD is a lot like Diablo (or the other way around) but considerably unlike World of Warcraft. &nbsp;I found myself trying to apply WoW rogue principles to my thief and getting frustrated when they didn&#39;t work or weren&#39;t possible. &nbsp;Then you have the multitude of dice and modifiers and stats and feats and powers and wait, is that encounter only or at will? &nbsp;Do I have any action points left? &nbsp;What does a saving throw do, anyway? &nbsp;Which dice do I roll this time? &nbsp;You want me to do math?!</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tYou get the point.</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tSomewhere near the middle of the adventure I realized that I really was not enjoying the thief class. &nbsp;As my friends on WoW can attest to, I have a serious &quot;altaholic&quot; problem. &nbsp;I want to be every class all the time. &nbsp;There was a little of that in my decision to let Daegerwin get arrested and jailed, but also I am just not much of a melee player. &nbsp;I never have been. &nbsp;Casting is near and dear to my heart, but as my niece Lydia had desperately wanted to be the mage, I backed off for her sake. &nbsp;Flipping through the Player&#39;s Handbook, I happened upon the cleric. &nbsp;A couple of weeks later, Carreth was born.</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tI wanted to test my limits with Carreth. &nbsp;I felt better about the gameplay aspect with him; I have always loved to heal and I work well as a support class. &nbsp;What I was really testing, though, was the roleplay. &nbsp;In retrospect I don&#39;t know what possessed me to make that harder on myself, but hindsight is 20/20, etc. &nbsp;I made him a man, first of all, because I wanted to see if I could roleplay a man convincingly. &nbsp;He is also charismatic without being over-the-top like Daegerwin was. &nbsp;The downside of this, at least in the beginning, was that he was downright boring. &nbsp;I went too far in the non-Daegerwin direction and everyone agreed he was a complete yawnfest. &nbsp;</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tCorey and I conferred and tried to work out how I could make him a little more interesting. &nbsp;We eventually agreed that Carreth ought to be a bit of a conspiracy nut, since followers of his deity, Ioun, specifically are always on the lookout for followers of Vecna. &nbsp;I took him a little to the extreme there on our next adventure by having him think practically everything was cult-related, but he was infinitely more interesting. &nbsp;I can work with that.</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tNow, here we are at the beginning of our next adventure. &nbsp;I am looking forward to it. &nbsp;Corey is a fantastic, slightly obsessive DM who makes the experience enriching and interesting. &nbsp;The game gets easier the more I play and the more familiar I become with the mechanics. &nbsp;I continue to learn what I won&#39;t do the next time&hellip;</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\t&hellip;when I convince Corey to let me retire Carreth and make a bard.</div>\r\n<div>\r\n\t&nbsp;</div>\r\n<div>\r\n\tWhat?</div>\r\n"}
{"title":"Hurmes","topic":"Persons of Note","summary":"The King of Fools, a too-tall, too-thin figure with a strange gait and a stranger face.","content":"<p>\r\n\tFarmers and merchants compete for the attention of the Sunday shoppers at the weekly open market. Throngs of townspeople mob the stalls, eyeing the wares on display and absently thumbing the coins in their pockets. The rattling sound of commerce echoes between walls of the buildings that surround the square, a pleasant din that invigorates and reassures and reminds one that no matter what strange things may be happening outside the city, daily life goes on without cease.</p>\r\n<p>\r\n\t<img alt=\"\" src=\"http://brambles.s3.amazonaws.com/ckeditor/picture/data/4db38a1f5adec77ab8000022/content_remus.png\" style=\"margin-left: 20px; margin-right: 20px; margin-top: 20px; margin-bottom: 20px; float: right; width: 204px; height: 239px; \" />But a weak current stirs the crowd, and a rivulet of space opens for a too-tall, too-thin figure with a strange gait, a stranger face, a stranger&#39;s face; streaked with white and grey and red, creases and crisscrosses in the makeup mask of a fool. But the fool doesn&#39;t inspire laughter, the fool doesn&#39;t even smile. The fool has his own mysterious errand.</p>\r\n<p>\r\n\tHe chants as he walks, a constant question, a soft plea, but seeminly neither expects nor wants an answer. Just the murmuring mummer calling for &quot;Alms, friends, alms for a beggar, alms, friends, alms for a beggar...&quot; This endless litany wends through his barely-parted and hissing lips like wisps of smoke.</p>\r\n<p>\r\n\tThe crowd is a sea that he must part, an obstacle to his destination. And so like the curving blade of a knife in the night he separates them, cutting relentlessly onward. The wound in the wake of his passing closes behind him in nervous silence.</p>\r\n"}
{"title":"The Battle of the Crater","topic":"History","summary":"In which the history of the Crater is reluctantly revealed.","content":"<p>\r\n\tFor a moment, Sister Thalia&#39;s face lost some of its luster, much as a summer day when a cloud passes before the sun. Reluctantly, it seemed, she began to speak of the dark days leading up to the Battle of the Crater.</p>\r\n<blockquote>\r\n\t<p>\r\n\t\tWhat I am about to tell you happened hundreds of years ago, before even the town of Thornbare rose from the hills, a time when the Brambles was little more than a thin grove of trees with a dark dream of dominion.</p>\r\n\t<p>\r\n\t\tFor some time, the Enclave had been warning the Emperor of ill omens and troubling rumors related to the Cult of Lumis, but he was distracted by trouble at the northern border and had little patience for their counsel. Finally, at the most urgent request of the very head of the Enclave himself, a garrison of troops was sent out from Trestis Fortuna to investigate the Cult and their activities.</p>\r\n\t<p>\r\n\t\tThe troops were led by Keegan, the hero of Rundimm, who was accompanied by his friends and long-time companions: Maareth, a warrior priestess of Bahamut, and Aolarne, an ageless Eladrin warlock.</p>\r\n\t<p>\r\n\t\tWhat they found was worse than even the Enclave feared. The Order of Lumis had found a weakness in the walls between the worlds, and was prying open a rift from which the very hounds of hell were emerging, making way for their darkest of gods.</p>\r\n\t<p>\r\n\t\tWhile the soldiers fought the army of the gnolls, hundkin, and other foul beasts, Keegan and the others snuck past into the very caverns from which the foul spawn of Lumis were pouring forth. What they found there and what happened in their struggle to seal the rift is lost to history, but they somehow climbed out from the pits with the rift held closed by no doubt powerful and ancient magics, perhaps some ritual with which the Enclave had equipped Aolarne before the party&#39;s departure from Trestis Fortuna.</p>\r\n\t<p>\r\n\t\tUpon their return to the battle between the forces of the Empire and the forces of Lumis, they discovered that the tide had turned against the men and that the hounds of hell were close to victory-- as if merely toying with the soldiers, picking them off in small groups while thickening the ranks that surrounded the few that remained.</p>\r\n\t<p>\r\n\t\tIt is said that Maareth fell to her knees at foot of the hill where the chieftains of Lumis&#39; army had their camp, and appealed to Bahamut himself to intervene on behalf of the Empire and the world. For a moment the sounds of battle subsided, as the sun reasserted itself in the sky and brilliant spears of light appeared amongst the ragged fog of the battlefield. A dull and distant whine could be heard, coming from everywhere and nowhere at once. Soon it grew into a resounding, crackling roar, as a dark spot in the sky resolved into a fiery rock hurtling downward with the force of divine vengeance.</p>\r\n\t<p>\r\n\t\tThe meteor struck the very hilltop of the chieftains, in a single instant obliterating the will and mind of the army. Their leaders lost in the smouldering pile of the shattered hill, the gnolls and their ilk scattered to the four winds.</p>\r\n\t<p>\r\n\t\tThus was the world saved on the very ground where the seeds of its future doom were planted. And to this day nothing good will grow at the Crater, for the ground remembers the foul blood that was spilled there.</p>\r\n</blockquote>\r\n<p>\r\n\tSo spoke Sister Thalia, and with a sigh she spoke no more.</p>\r\n"}
